; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 13523)
	(= (fuel plane1) 784)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 18)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at plane2 city0)
	(= (capacity plane2) 12013)
	(= (fuel plane2) 1031)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 12)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 9)
	(at plane3 city0)
	(= (capacity plane3) 14939)
	(= (fuel plane3) 4441)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 1)
	(at person1 city1)
	(at person2 city2)
	(at person3 city2)
	(at person4 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 696)
	(= (distance city0 city2) 620)
	(= (distance city1 city0) 696)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 745)
	(= (distance city2 city0) 620)
	(= (distance city2 city1) 745)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city1)
	(at person2 city0)
	(at person3 city2)
	(at person4 city1)
	))

(:metric minimize (+ (* 5 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane1 city2)
   changed: (fuel plane1) from 784 to 13523
   goals met: 2 of 4
2. (board person2 plane1 city2)
   deleted: (at person2 city2)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 4
3. (board person4 plane1 city2)
   deleted: (at person4 city2)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 4
4. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 3100, (fuel plane1) from 13523 to 10423
   goals met: 2 of 4
5. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (at person2 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 3 of 4
6. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 3100 to 6580, (fuel plane1) from 10423 to 6943
   goals met: 3 of 4
7. (debark person4 plane1 city1)
   deleted: (in person4 plane1)
   added: (at person4 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 4
